# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# # Lab | Hypothesis Testing

# ## Introduction

# In this lab we'll familiarize you with one sample hypothesis tests. 
#You will also write Python code to conduct 
#one sample hypothesis tests as well as construct confidence intervals.

# ## Deliverables
# - `main.ipynb`.
# ## Submission
# Upon completion, add your deliverables to git. Then commit git and push your branch to the remote.
# ## Resources
# [T Test](http://b.link/test50)
# [Hypothesis Tests in SciPy](http://b.link/scipy65)
# [Standard Error in SciPy](http://b.link/scipy86)
# [One Sample Tests of Proportions](http://b.link/categorical45)

In [2]:
# import numpy and pandas
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
import scipy.stats
from scipy import stats

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [3]:
# Your code here:
# https://data.cityofchicago.org/widgets/xzkq-xp2w similar dataset
data = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')
display(data.shape)
data

(33702, 8)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
...,...,...,...,...,...,...,...,...
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

Examine the `salaries` dataset using the `head` function below.

In [4]:
# # Your code here:
# The head function in Python displays the first 
#five rows of the dataframe by default. It takes 
#in a single parameter: the number of rows. 
#We can use this parameter to display the number of rows of our choice.
data.head(5)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [5]:
# The function calculates the proportion of missing values in the dataframe "data".
# The ".isna()" method returns a dataframe of the same shape as "data" with True where the original value is missing and False otherwise.
# The ".sum()" method sums up the number of True values for each column, giving the number of missing values in each column.
# The division by "len(data)" calculates the proportion of missing values as a fraction of the total number of rows in the dataframe.
# The resulting output is a series with the column names as indices and the proportions of missing values as values.

In [6]:
# Your code here:
data.isna().sum()/len(data)

Name                 0.000000
Job Titles           0.000000
Department           0.000000
Full or Part-Time    0.000000
Salary or Hourly     0.000000
Typical Hours        0.757462
Annual Salary        0.242538
Hourly Rate          0.757462
dtype: float64

In [7]:
# The line of code creates a series called "data_null_cols" that contains the number of missing values (i.e. Null values) in each column of the dataframe "data".

# The ".isnull()" method returns a dataframe with the same shape as "data", but with True where the original value is missing (i.e. Null) and False otherwise.

# The ".sum()" method then sums up the number of True values for each column, giving the number of missing values in each column.

# Finally, the result is assigned to the series "data_null_cols". The series has the column names as indices and the number of missing values as values.

In [8]:
data_null_cols = data.isnull().sum()
data_null_cols

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25528
Annual Salary         8174
Hourly Rate          25528
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [9]:
# The code displays the frequency distribution of the values in the "Salary or Hourly" column of the dataframe "data".

# The "value_counts()" method returns a series containing the unique values of the "Salary or Hourly" column as indices and their frequencies as values.

# The "dropna=False" argument includes missing values (i.e. Null values) in the calculation of the frequency distribution.

# The "display()" function is used to display the resulting frequency distribution in a more user-friendly format.

In [10]:
# Your code here:
display(data['Salary or Hourly'].value_counts(dropna=False))

Salary    25528
Hourly     8174
Name: Salary or Hourly, dtype: int64

In [11]:
display(data['Hourly Rate'].value_counts(dropna=False))

NaN      25528
37.45     1495
43.72      779
38.52      528
19.86      345
         ...
33.00        1
52.43        1
26.90        1
21.84        1
37.69        1
Name: Hourly Rate, Length: 179, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [12]:
# The code calculates the frequency distribution of the values in the "Department" column of the dataframe "data".

# The "value_counts()" method returns a series containing the unique values of the "Department" column as indices and their frequencies as values.

# The result is a series with the unique values of the "Department" column as indices and their frequencies as values, sorted by frequency in descending order.

In [41]:
# # Your code here:
#  List all departments 
#     count of employees 
#     in each department.
data['Department'].value_counts()

POLICE                 13848
FIRE                    4627
STREETS & SAN           2175
WATER MGMNT             1914
AVIATION                1856
OEMC                    1737
TRANSPORTN              1113
PUBLIC LIBRARY          1088
DAIS                    1033
FAMILY & SUPPORT         656
FINANCE                  544
HEALTH                   467
LAW                      398
CITY COUNCIL             362
BUILDINGS                258
PUBLIC SAFETY ADMIN      244
BUSINESS AFFAIRS         167
HOUSING & ECON DEV       154
COPA                     123
BOARD OF ELECTION        111
MAYOR'S OFFICE           104
INSPECTOR GEN             95
CITY CLERK                88
PROCUREMENT               84
HUMAN RESOURCES           75
ANIMAL CONTRL             75
CULTURAL AFFAIRS          74
HOUSING                   66
BUDGET & MGMT             44
ADMIN HEARNG              38
DISABILITIES              28
TREASURER                 28
HUMAN RELATIONS           17
BOARD OF ETHICS            8
POLICE BOARD               2
LICENSE APPL COMM          1
Name: Department, dtype: int64

In [ ]:
# The code creates a pivot table from the dataframe "data".
# The pivot table has the unique values of the "Department" column as rows (index), and the frequencies of the "Job Titles" column as values.
# The "values" argument specifies the column(s) to use as values in the pivot table. The "aggfunc" argument specifies the aggregation function to apply to the values. In this case, "count" is used to count the number of occurrences of each "Job Title" in each "Department".
# The result is a dataframe with the unique values of the "Department" column as the row indices and a single column, with the name specified by the aggregation function (e.g. "count"), containing the frequency of "Job Titles" in each "Department".

In [14]:
data.pivot_table(index = ['Department'],values = ['Job Titles'], aggfunc = 'count')

                     Job Titles
Department
ADMIN HEARNG                 38
ANIMAL CONTRL                75
AVIATION                   1856
BOARD OF ELECTION           111
BOARD OF ETHICS               8
BUDGET & MGMT                44
BUILDINGS                   258
BUSINESS AFFAIRS            167
CITY CLERK                   88
CITY COUNCIL                362
COPA                        123
CULTURAL AFFAIRS             74
DAIS                       1033
DISABILITIES                 28
FAMILY & SUPPORT            656
FINANCE                     544
FIRE                       4627
HEALTH                      467
HOUSING                      66
HOUSING & ECON DEV          154
HUMAN RELATIONS              17
HUMAN RESOURCES              75
INSPECTOR GEN                95
LAW                         398
LICENSE APPL COMM             1
MAYOR'S OFFICE              104
OEMC                       1737
POLICE                    13848
POLICE BOARD                  2
PROCUREMENT                  84
PUBLIC LIBRARY             1088
PUBLIC SAFETY ADMIN         244
STREETS & SAN              2175
TRANSPORTN                 1113
TREASURER                    28
WATER MGMNT                1914

In [ ]:
# The code creates a pivot table from the dataframe "data".
# The pivot table has the unique values of the "department" column as rows (index), and the number of unique names in the "name" column as values.
# The "values" argument specifies the column(s) to use as values in the pivot table. The "aggfunc" argument specifies the aggregation function to apply to the values. In this case, a dictionary is used to apply the "pd.Series.nunique" method, which calculates the number of unique values, to the "name" column.
# The ".reset_index()" method is used to reset the row indices to default integers, turning the pivot table into a regular dataframe with columns for the index (Department) and the aggregated values (number of unique names).
# The result is a dataframe with two columns: "Department" and "name", where the "Department" column contains the unique values of the "department" column, and the "name" column contains the number of unique names in each department.

In [47]:
# Your code here:
data.pivot_table(index=['Department'], values=['Name'], aggfunc=({'Name':pd.Series.nunique})).reset_index()

             Department   Name
0          ADMIN HEARNG     38
1         ANIMAL CONTRL     75
2              AVIATION   1855
3     BOARD OF ELECTION    111
4       BOARD OF ETHICS      8
5         BUDGET & MGMT     44
6             BUILDINGS    258
7      BUSINESS AFFAIRS    167
8            CITY CLERK     88
9          CITY COUNCIL    362
10                 COPA    123
11     CULTURAL AFFAIRS     74
12                 DAIS   1032
13         DISABILITIES     28
14     FAMILY & SUPPORT    655
15              FINANCE    544
16                 FIRE   4615
17               HEALTH    467
18              HOUSING     66
19   HOUSING & ECON DEV    154
20      HUMAN RELATIONS     17
21      HUMAN RESOURCES     75
22        INSPECTOR GEN     95
23                  LAW    398
24    LICENSE APPL COMM      1
25       MAYOR'S OFFICE    104
26                 OEMC   1737
27               POLICE  13784
28         POLICE BOARD      2
29          PROCUREMENT     84
30       PUBLIC LIBRARY   1088
31  PUBLIC SAFETY ADMIN    244
32        STREETS & SAN   2170
33           TRANSPORTN   1111
34            TREASURER     28
35          WATER MGMNT   1912

In [48]:
data

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
...,...,...,...,...,...,...,...,...
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

H zero = hourly wage = 30 / hr
H one = hourly wage !=30 / hr

In [ ]:
# The code creates a new variable "hourly_wage" that holds the values from the "Hourly Rate" column of the dataframe "data". The ".dropna()" method is used to remove missing values (NaN) from the column.
# Next, the ".replace()" method is used to remove "$" and "," characters from the values in the "hourly_wage" variable using a regular expression.
# Finally, the ".astype(float)" method is used to convert the values in "hourly_wage" from string to float data type. The result is a Pandas Series with the cleaned and transformed hourly rate data.

In [49]:
# Your code here:
hourly_wage = data['Hourly Rate'].dropna()
hourly_wage
hourly_wage = hourly_wage.replace("[$,]", "", regex=True)
hourly_wage = hourly_wage.astype(float)

In [ ]:
# This code performs a one-sample t-test on the "hourly_wage" 
#variable to see if it has a mean of 30. 
#The t-test returns a test statistic "stat" and a p-value "pvalue". 
#The test statistic measures the difference between the 
#sample mean and the specified mean (30) in standard error units. 
#The p-value represents the probability of observing a t-statistic 
#as extreme as the one computed from the sample, 
#if the null hypothesis (that the population mean is 30) is true.
#The code then prints the test statistic and the p-value.

In [50]:
stat,pvalue = stats.ttest_1samp(hourly_wage,30)
print('Stat_Score = ',stat)
print('Pvalue = ',pvalue)

Stat_Score =  31.211500329216044
Pvalue =  3.825475847673794e-202

The small pvalue under the threshhold of 0,05
Null hypothesis that the hourly worker average is 30 can be rejected. Because of the positive stat score it should be more than 30.

In [51]:
hourly_wage.mean()

34.58644971862046

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

H zero = Salary is <= 86000;
H one = Salary is>86000

In [ ]:
# The code above is selecting the rows of data where the Department is "POLICE" and storing it in the variable department_salary. From department_salary, it is extracting the column "Annual Salary" and storing it in the variable cops.
# Next, it is dropping the missing values (NA) from the cops series and storing the result in cops_salary.
# The code then removes the "$" and "," from the cops_salary values, and converts the values from strings to floating-point numbers. Finally, the cops_salary series is displayed.

In [52]:
department_salary = data[data['Department']=='POLICE']
cops = department_salary['Annual Salary']

cops_salary = cops.dropna()


cops_salary = cops_salary.replace("[$,]", "", regex=True)
cops_salary = cops_salary.astype(float)
cops_salary

1         93354.0
4         90024.0
6        111444.0
7        103932.0
9         95736.0
           ...
33696     80016.0
33697     72510.0
33698     76266.0
33699     90024.0
33700     93354.0
Name: Annual Salary, Length: 13824, dtype: float64

In [53]:
stats_value, pvalue = stats.ttest_1samp(cops_salary,86000)
print('Stat_Score =  ',stat)
print('Pvalue =  ',pvalue/2)

Stat_Score =   31.211500329216044
Pvalue =   6.119566952121482e-76

In [22]:
# The p-value is below threshhold of .05 and the Stat_Score is positive, the null (Ho) can be rejected.
# Average salary is more than last year's average. Checking again.

In [ ]:
# This code calculates the 95% confidence interval of the average annual salary of police officers. It does this by first defining the confidence level as 0.95 and calculating the degrees of freedom (df) by subtracting 1 from the number of observations in the cops_salary series. The mean (mu) and standard error (se) of the cops_salary series are then calculated using the mean() and stats.sem() functions, respectively. Finally, the confidence interval is calculated using the stats.t.interval() function, which takes the confidence level, degrees of freedom, mean, and standard error as inputs.

In [54]:
con_level = 0.95
df = len(cops_salary)-1
mu = cops_salary.mean()
se = stats.sem(cops_sal)

conf_int = stats.t.interval(con_level,df,mu,se)
print('Confidence interval is between', conf_int)

Confidence interval is between (88534.1182885883, 89134.11955863392)

In [55]:
cops_salary.mean()

88834.11892361111

Using the `crosstab` function, find the department that has the most hourly workers.

In [58]:
# Your code here:
stats_value, pvalue = stats.ttest_1samp(cops_salary,86000)
print('Stat_Score =  ',stat)
print('Pvalue =  ',pvalue/2)

Stat_Score =   31.211500329216044
Pvalue =   6.119566952121482e-76

In [59]:
con_level = 0.95
df = len(cops_salary)-1
mu = cops_salary.mean()
se = stats.sem(cops_salary)

conf_int = stats.t.interval(con_level,df,mu,se)
print('Confidence interval is between', conf_int)

Confidence interval is between (88534.1182885883, 89134.11955863392)

p value is below threshhold of 0.05 and the stat score is positive, null can be rejected. 
Average salary is more than last year's average. 
Checking again

In [57]:
cops_salary.mean()

88834.11892361111

Using the `crosstab` function, find the department that has the most hourly workers.

In [ ]:
# The code creates a cross tabulation of the 'Department' and 'Salary or Hourly' columns in the 'data' DataFrame. It then finds the department with the maximum number of hourly workers by selecting the row with the maximum value in the 'Hourly' column. The result is stored in the 'most_hourly' DataFrame.

In [27]:
dept_hour = pd.crosstab(data['Department'],data['Salary or Hourly'])
dept_hour
most_hourly = dept_hour.loc[dept_hour['Hourly'] == dept_hour['Hourly'].max()]
most_hourly

Salary or Hourly  Hourly  Salary
Department
STREETS & SAN       1846     329

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

If the hypothesis is less than, then to reject the test statistic must also be negative. 
H zero = hourly wage = 35 / hr
H one = hourly wage !=35 / hr

In [ ]:
# This code is selecting the hourly wage data for employees in the 'STREETS & SAN' department, and cleaning the data by removing "$" and "," signs, and converting the data type from string to float. The result is a pandas series of hourly wages for employees in the 'STREETS & SAN' department.

In [28]:
# Your code here:
dept_wage = data[(data['Department']=='STREETS & SAN') & (data['Salary or Hourly']=='Hourly')]['Hourly Rate']

dept_wage = dept_wage.replace("[$,]", "", regex=True)
dept_wage = dept_wage.astype(float)
dept_wage

15       40.78
16       38.52
26       38.52
49       29.96
65       37.45
         ...
33623    38.01
33624    37.45
33667    37.45
33668    38.52
33676    25.95
Name: Hourly Rate, Length: 1846, dtype: float64

In [29]:
stats_value, pvalue = stats.ttest_1samp(dept_wage,35)
print('Stat_Score =  ',stat)
print('Pvalue =  ',pvalue/2)

Stat_Score =   31.211500329216044
Pvalue =   3.2902372218867895e-05

The one-sided ttest has a p-value well below 0,05 and the stat score is negative. Checking average again.

In [30]:
dept_wage.mean()

35.55229685807062

this number is not far from the mean - checking distribution

In [31]:
dept_wage.describe()

count    1846.000000
mean       35.552297
std         5.932167
min        21.730000
25%        36.450000
50%        37.450000
75%        38.520000
max        55.100000
Name: Hourly Rate, dtype: float64

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [32]:
# Your code here:
con_level = 0.95
df = len(hour_worker)-1
mu = hour_worker.mean()
se = stats.sem(hour_worker)

conf_int = stats.t.interval(con_level,df,mu,se)
print('Confidence interval is between', conf_int)

Confidence interval is between (34.29839539204361, 34.874504045197305)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [ ]:
# https://stackoverflow.com/questions/15033511/compute-a-confidence-interval-from-sample-data
# https://www.statology.org/confidence-intervals-python/

In [33]:
# Your code here:
cops_sal

conf_level = 0.95
df = len(cops_sal)-1
mu = cops_sal.mean()
se = stats.sem(cops_sal)

conf_int_cop = stats.t.interval(conf_level,df,mu,se)
print('Confidence interval for police salary is between', conf_int_cop)

Confidence interval for police salary is between (88534.1182885883, 89134.11955863392)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [34]:
# create hourly pay table

In [ ]:
# The proportions_ztest function is a part of the statsmodels library and is used to perform a z-test for proportions. This test can be used to determine if the proportion of successes (e.g. the number of "yes" responses) in a sample is significantly different from a specified proportion. It works by comparing the observed proportion in the sample to the expected proportion, which is often taken to be 0.5 or a specified value. The test returns a test statistic (z-score) and a p-value, which can be used to determine the significance of the result.

In [35]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest

In [ ]:
# The function proportions_ztest is used to perform a one-sample z-test to test the proportion of a binary variable in a population. It tests if the proportion of success (yes, true, etc.) in the population is different from a specified value. The test assumes that the binary variable is generated from a Bernoulli distribution.
# The function takes in 3 arguments:
# count: The number of success in the sample
# nobs: The number of observations in the sample
# value: The value of the proportion of success in the population to be tested against.
# In the code you provided, len(hour_worker) is the number of successes (people who are hourly workers), len(data) is the number of observations (people), and 0.25 is the specified proportion of success in the population being tested against.

In [ ]:
# https://www.statsmodels.org/dev/generated/statsmodels.stats.proportion.proportions_ztest.html

In [36]:
proportions_ztest(count=len(hour_worker),
                 nobs=len(data),
                 value=0.25)

(-3.1962453870335, 0.0013922864704323116)

In [37]:
# Your code here:
data = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')
display(data.shape)
data

(33702, 8)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
...,...,...,...,...,...,...,...,...
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

In [38]:
data.to_excel('Current_Employee_Names__Salaries__and_Position_Titles.xlsx', index=False)